app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "description", "location", "name", "updated_at", "user_id", "venue") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", "2014-08-14 23:55:56.047092"], ["description", ""], ["location", ""], ["name", "new_event"], ["updated_at", "2014-08-14 23:55:56.047092"], ["user_id", 1], ["venue", ""]]
---
  def create
    p params
    @event = current_user.created_events.create(event_params)

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT "invitations".* FROM "invitations"  WHERE "invitations"."event_id" = ?  [["event_id", 1]]
---
  def show
    @event = Event.where(id: params[:id])
    @event_rails = Event.find(params[:id])
    @sent_invitations = @event.first.invitations