app/controllers/invitations_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "invitations" ("created_at", "event_id", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-08-15 01:06:00.649147"], ["event_id", 1], ["status", "pending"], ["updated_at", "2014-08-15 01:06:00.649147"], ["user_id", 6]]
---
  def create
    @event = Event.find(params[:id])
    @invitation = @event.invitations.create(invitation_params)