app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "username") VALUES (?, ?, ?)  [["email", "stella@stella.com"], ["password_digest", "$2a$10$jztqubwsuaJ9rvyBb2JovuaoXtUi3EbBIWN9WAuSHGmx2ay1/38Xq"], ["username", "stella"]]
---
  def create
    p session[:user_id]
    @user = User.create(username: params[:user][:username],
                        email: params[:user][:email],
                        password: params[:user][:password])

SELECT  "users".* FROM "users"  WHERE "users"."username" = 'user1' LIMIT 1
---
  def login
    @user = User.find_by(username: params[:user][:username])

SELECT  "users".* FROM "users"  WHERE "users"."username" = 'stella' LIMIT 1
---
  def follow
    @friend = User.find_by(username: params[:user][:username])

SELECT  "users".* FROM "users"  WHERE "users"."username" = 'user5' LIMIT 1
---
  def unfollow
    @friend = User.find_by(username: params[:user][:username])

UPDATE "users" SET "password_digest" = ?, "username" = ? WHERE "users"."id" = 6  [["password_digest", "$2a$10$g04GIx6.novERMyEc7hdG.U.FMVFX4jQFSjVkHfvJ8OKv8JWwAnsO"], ["username", "elz"]]
---
  def update
    current_user.update(user_params)

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @user = User.where(id: params[:id])